Repository: codyaustun/GF2
Catalog: src/*/logsim.po
Languages: fr

source: correctly!
fr: correctement!

source: cycles run.
fr: cycles de fonctionner.

source: cycles total.
fr: cycles au total.

source: parsed correctly.
fr: analysée correctement.

source: was truncated.
fr: a été tronqué

source: were completed.
fr: ont été achevés

source: &About
fr: &Propos

source: &Copy
fr: &Copier

source: &File
fr: &Filchier

source: &Parse File
fr: &Analyser le fichier

source: &Quit
fr: &Quitter

source: &Select All
fr: &Sélectionnez tous

source: 'FIN' should follow the monitors list
fr: «FIN» devrait suivre la liste des moniteurs

source: A DTYPE only has signals Q, QBAR, DATA, CLK, SET and CLEAR
fr: Un DTYPE a que des signaux Q, Qbar, DATA, CLK, SET et CLEAR

source: A XOR only 2 inputs.
fr: Un XOR seulement 2 entrées.

source: A clock's output is just specified by the clock's name.
fr: De sortie Une horloge est juste spécifié par son nom de l'horloge.

source: A switch does not have this option.
fr: Un commutateur ne possède pas cette option.

source: A switch's output is just specified by the clock's name.
fr: Une sortie de commutation est juste spécifié par le nom du commutateur.

source: About Logsim
fr: À propos de Logsim

source: Add Monitor
fr: Ajouter Surveiller

source: Added Monitor:
fr: Ajouté Moniteur:

source: All inputs must be connected to an output.
fr: Toutes les entrées doivent être connectée à une sortie.

source: An AND does not have this option.
fr: Un ET n'a pas cette option.

source: An NAND does not have this option.
fr: Un NON-ET ne possède pas cette option.

source: An NOR does not have this option.
fr: Une porte NON-OU ne possède pas cette option.

source: An OR does not have this option.
fr: Un OU ne possède pas cette option.

source: An input must be second in a connection
fr: Une entrée doit être une deuxième connexion

source: An output must come first in a connection
fr: Une sortie doit venir d'abord dans une connexion

source: Are You Sure?
fr: Etes-vous sûr?

source: Cancel
fr: Annuler

source: Cannot operate GUI without names, devices and monitor classes
fr: Impossible de faire fonctionner l'interface graphique sans noms, des dispositifs et des classes de moniteur

source: Choose file to parse
fr: Choisir un fichier à analyser

source: Clea&r
fr: &Effacer

source: Console Height:
fr: Consolez-Hauteur:

source: Console Options
fr: Options de la console

source: Continue
fr: Continuer

source: Could not parse
fr: Impossible d'analyser

source: Detected an invalid symbol.
fr: Détecté un symbole invalide.

source: Do you really want to clear the console?
fr: Voulez-vous vraiment effacer la console?

source: Error (
fr: Erreur (

source: Error: Comment not closed
fr: Erreur: Commentaire pas fermé

source: Error: network is oscillating
fr: Erreur: le réseau est oscillante

source: Expected a ',' or ';'
fr: Prévue a ',' ou ';'

source: Expected a dash.
fr: Prévue par un tiret.

source: Expected a device option.
fr: Prévue une option appareil.

source: Expected a device type.
fr: S'attendait à un type d'appareil.

source: Expected a dollar sign.
fr: Prévue un signe de dollar.

source: Expected a name
fr: Prévue d'un nom

source: Expected an equals sign.
fr: Prévue d'un signe égal.

source: Expected an input or output
fr: S'attendait à une entrée ou de sortie

source: Fail
fr: Impossible de charger l'échec.

source: File opened successfully
fr: Le fichier ouvert avec succès

source: Forgot a ';' at the end of the connections section
fr: Mot un ';' à la fin de la section des connexions

source: Forgot a ';' at the end of the devices section
fr: Mot un ';' à la fin de la section des dispositifs

source: Forgot a ';' at the end of the monitors section
fr: Mot un ';' à la fin de la section moniteurs

source: Keywords cannot be names
fr: Mots-clés ne peuvent pas être des noms de

source: Large
fr: Grand

source: Logic Circuit Reset.
fr: Circuit logique de restauration.

source: Logic Simulator GUI Tom Mottram May 2012
fr: Interface graphique pour le simulateur de la logique Tom Mottram May 2012

source: Max number of monitors reached: 10
fr: Nombre maximum de moniteurs atteint: 10

source: Maximum number of cycles reached, please run again.
fr: Le nombre maximum de cycles atteint, s'il vous plaît exécuter à nouveau.

source: Medium
fr: Moyen

source: Monitor already exists
fr: Moniteur existe déjà

source: Monitors
fr: Moniteurs

source: Monitors can only be connected outputs
fr: Les moniteurs peuvent être connectés sorties

source: Must run the network before continuing.
fr: Doit faire fonctionner le réseau avant de poursuivre.

source: No Switches
fr: Pas de commutateurs

source: No monitors to remove
fr: Pas de moniteurs pour éliminer

source: Off
fr: Arrêt

source: On
fr: Marche

source: Remove Monitor
fr: Retirer Surveiller

source: Run
fr: Exécuter

source: Save
fr: Enregistrer

source: Save to &File
fr: &Enregistrer dans un fichier

source: Set Off
fr: Éteignez

source: Set On
fr: Tournez

source: Skipping to next line
fr: Saut à la ligne suivante

source: Small
fr: Petit

source: Switches
fr: Commutateurs

source: Text Size:
fr: Taille du texte:

source: The connections list should follow the devices list
fr: La liste des connexions devrait suivre la liste des périphériques

source: The device does not exist
fr: Le périphérique n'existe pas

source: The devices list must come first.
fr: La liste des périphériques doit venir en premier.

source: The monitors list should follow the connections list
fr: La liste des moniteurs doivent suivre la liste des connexions

source: The name has already been used
fr: Le nom a déjà été utilisé

source: The number of clock cycles must be between 1 and 1000.
fr: Le nombre de cycles d'horloge doit être comprise entre 1 et 1000.

source: There should be a ';' at the end of the connections section.
fr: Il devrait y avoir un ';' à la fin de la section des connexions.

source: There should be a ';' at the end of the devices section.
fr: Il devrait y avoir un ';' à la fin de la section périphériques.

source: There should be a ';' at the end of the monitors section.
fr: Il devrait y avoir un ';' à la fin de la section moniteurs.

source: There should be a colon following the keyword 'CONNECTIONS'.
fr: Il devrait y avoir deux points à la suite 'CONNECTIONS' le mot-clé.

source: There should be a colon following the keyword 'DEVICES'.
fr: Il devrait y avoir deux points à la suite du mot-clé 'DEVICES'.

source: There should be a colon following the keyword 'MONITORS'.
fr: Il devrait y avoir deux points à la suite du mot-clé 'MONITORS'.

source: This gate doesn't have that many inputs.
fr: Cette porte n'a pas d'entrées que de nombreux.

source: This input has already been used
fr: Cette entrée a déjà été utilisé

source: Unexpected error
fr: Une erreur inattendue

source: Warning
fr: Avertissement

source: Warning max cycles reached, only
fr: Avertissement cycles max atteint, seulement

source: Warning: Max parameter value = 1000
fr: Attention: la valeur du paramètre max = 1000

source: Warning: Name
fr: Avertissement: Nom

source: You must specify either an input or output of a DTYPE
fr: Vous devez spécifier une entrée ou sortie d'un DTYPE
